In [1]:
#A_ch04_201_missingValue.ipynb

In [2]:
import pandas as pd

In [3]:
#以pd.read_csv() 讀取 missingData01.csv 成為 DataFrame 'df1'
df1=pd.read_csv('missingData01.csv')

In [4]:
#檢視 df1
df1

    A   B     C   D     E     F
0   1   2   3.0   4   5.0   6.0
1   7   8   9.0  10  11.0   NaN
2  20  30   NaN  50  60.0  70.0
3   0  15  14.0  13   NaN  11.0

In [5]:
#以DataFrame.isnull() 檢查 missing values
df1.isnull()

       A      B      C      D      E      F
0  False  False  False  False  False  False
1  False  False  False  False  False   True
2  False  False   True  False  False  False
3  False  False  False  False   True  False

In [6]:
df1.isnull().sum() #統計各fields null 數目

A    0
B    0
C    1
D    0
E    1
F    1
dtype: int64

In [7]:
#1. 刪除 missing values 所在的樣本或欄位
#   DataFrame.dropna()

In [8]:
#1.a 刪除 missing values 所在的樣本(row, axis=0 預設)
df1.dropna()

   A  B    C  D    E    F
0  1  2  3.0  4  5.0  6.0

In [9]:
#1.b 刪除 missing values 所在的欄位(field, axis=1)
df1.dropna(axis=1)

    A   B   D
0   1   2   4
1   7   8  10
2  20  30  50
3   0  15  13

In [10]:
#1.c dropna() 其他參數

In [11]:
#drop rows that have not at least 5 non-NaN values
df1.dropna(thresh=5)

   A   B     C   D     E     F
0  1   2   3.0   4   5.0   6.0
1  7   8   9.0  10  11.0   NaN
3  0  15  14.0  13   NaN  11.0

In [12]:
#only drop rows where all columns are NaN
df1.dropna(how='all')

    A   B     C   D     E     F
0   1   2   3.0   4   5.0   6.0
1   7   8   9.0  10  11.0   NaN
2  20  30   NaN  50   NaN  70.0
3   0  15  14.0  13   NaN  11.0

In [13]:
#only drop rows where NaN appear in specific columns (heare: ['C','E'])
df1.dropna(subset=['C','E'])

   A  B    C   D     E    F
0  1  2  3.0   4   5.0  6.0
1  7  8  9.0  10  11.0  NaN

In [14]:
# 2. 填補 missing values (使用 scikit-learn 的 Imputer類別)

In [15]:
from sklearn.preprocessing import Imputer

In [16]:
#create a Imputer object 'imr', 
#設定 strategy='mean', axis=0
imr=Imputer(missing_values='NaN',strategy='mean',axis=0)

In [17]:
#以 DataFrame 'df1' fit Imputer 'imr'
imr=imr.fit(df1)

In [18]:
#以 fit 完成的 'imr' 對 'df1.values' 做 transform 成為 'imputed_data'
imputed_data=imr.transform(df1.values)

In [19]:
#檢視 原資料 'df1'
df1

    A   B     C   D     E     F
0   1   2   3.0   4   5.0   6.0
1   7   8   9.0  10  11.0   NaN
2  20  30   NaN  50   NaN  70.0
3   0  15  14.0  13   NaN  11.0

In [21]:
#檢視填補後的資料
from pandas import DataFrame
DataFrame(imputed_data)

      0     1          2     3     4     5
0   1.0   2.0   3.000000   4.0   5.0   6.0
1   7.0   8.0   9.000000  10.0  11.0  29.0
2  20.0  30.0   8.666667  50.0   8.0  70.0
3   0.0  15.0  14.000000  13.0   8.0  11.0

In [22]:
#練習1: axis=1, 計算「列的平均值」
#練習2: stratdgy='median' (中位數) / 'most_frequent' (出現最多的值),
#       most_frequent 是很常用的作法